Repository: starcat-app/Starcat
Catalog: Starcat/Resources/Localizable.xcstrings
Source language: en
Languages: ar, de, es, fr, id, it, ja, ko, nl, pl, pt_br, ru, tr, uk, vi, zh_hans, zh_hant

# agent.weekly.tool.log.topicsClustered
source: Clustered frozen repository snapshots into weekly report topics.
ar: تم تجميع صور المستودع المجمدة في مواضيع تقرير أسبوعي.
de: Eingefrorene Repository-Snapshots in wöchentliche Berichts-Themen gruppiert.
es: Clasificó instantáneas de repositorios congelados en temas del informe semanal.
fr: Regroupement des instantanés de dépôt gelés en sujets du rapport hebdomadaire.
id: Mengelompokkan snapshot repositori yang dibekukan menjadi topik laporan mingguan.
it: Clusterizzati gli snapshot dei repository congelati in argomenti del report settimanale.
ja: 凍結リポジトリスナップショットを週次レポートのトピックにクラスタリングしました。
ko: 동결된 저장소 스냅샷을 주간 보고서 주제로 클러스터링했습니다.
nl: Gegroepeerde gekoelde repository-snapshots in wekelijkse rapport-thema’s.
pl: Zagrupowano zamrożone snapshoty repozytoriów w tematy raportu tygodniowego.
pt_br: Agrupou *snapshots* de repositório congelados em tópicos do relatório semanal.
ru: Сгруппированы снимки репозиториев в темы еженедельного отчёта.
tr: Depo anlık görüntüleri haftalık rapor konularına gruplandırıldı.
uk: Сформовано теми щомісячного звіту на основі кластеризації снимків заморожених репозиторіїв.
vi: Nhóm snapshot kho đông lạnh thành chủ đề báo cáo tuần.
zh_hans: 已将冻结仓库快照聚类为周报主题。
zh_hant: 將凍結倉庫快照群組成週報主題。

# agent.weekly.topic.crossLanguage
source: Cross-language Tools and Infrastructure
ar: Starcat GitHub Agent RAG Tools and Infrastructure
de: Mehrsprachige Tools und Infrastruktur
es: Herramientas y Infraestructura Multilingüe
fr: Outils et Infrastructure Multi-langues
id: Starcat Tools dan Infrastruktur Berbahasa Multi
it: Strumenti e Infrastruttura Cross-Language
ja: Starcat, GitHub Agent, RAG 関連ツールとインフラ
ko: Starcat, GitHub Agent, RAG 및 기타 도구와 인프라
nl: Cross-language Tools en Infrastructuur
pt_br: Ferramentas e Infraestrutura Multi-linguagem
tr: Çok Dilli Araçlar ve Altyapı
vi: Starcat Công cụ và Cơ sở hạ tầng đa ngôn ngữ
zh_hans: 跨语言工具与基础设施
zh_hant: 跨語言工具與基礎設施

# agent.weekly.topic.languageFormat
source: %@ Ecosystem Projects
ar: %@ Projects
de: %@ Ökosystem-Projekte
es: %@ Proyectos del Ecosistema
fr: %@ Projets Ecosystème
it: %@ Ecosistema Progetti
ja: %@ エコシステムプロジェクト
ko: %@ 언어 생태계 프로젝트
nl: %@ Ecosystem Projecten
pt_br: %@ Projetos de Ecosistema
ru: %@ Экосистемные Проекты
tr: %@ Ekolü Projeleri
zh_hans: %@ 生态项目
zh_hant: %@ 生態系統專案

# agent.weekly.topic.other
source: Other
ar: أخرى
de: Sonstiges
es: Otros
fr: Autre
id: Lainnya
it: Altro
ja: その他
ko: 기타
nl: Anders
pl: Inne
pt_br: Outros
ru: Другое
tr: Diğerleri
uk: Інше
vi: Khác
zh_hans: 其他
zh_hant: 其他

# agent.weekly.topic.reason
source: Grouped by primary language to form weekly report sections.
ar: تم تجميعها حسب اللغة الرئيسية لتكوين أقسام تقرير أسبوعي.
de: Nach Primärsprache gruppiert, um wöchentliche Berichtsabschnitte zu bilden.
es: Agrupado por lenguaje principal para formar secciones del informe semanal.
fr: Regroupé par langage principal pour former les sections du rapport hebdomadaire.
id: Dikelompokkan berdasarkan bahasa utama untuk membentuk bagian laporan mingguan.
it: Gruppato per linguaggio primario per formare sezioni del report settimanale.
ja: 主な言語でグループ化し、週次レポートのセクションを形成しました。
ko: 주간 보고서 섹션을 구성하기 위해 주요 언어로 그룹화했습니다.
nl: Gegroepeerd naar primaire taal om secties van het wekelijkse rapport te vormen.
pl: Zagrupowane według głównego języka, aby utworzyć sekcje raportu tygodniowego.
pt_br: Agrupado por linguagem primária para formar seções do relatório semanal.
ru: Сгруппировано по основному языку для формирования разделов еженедельного отчёта
tr: Ana diline göre gruplandırıldı ve haftalık rapor bölümleri oluşturuldu.
uk: Груповано за основною мовою для формування розділів щомісячного звіту.
vi: Nhóm theo ngôn ngữ chính để tạo các phần báo cáo tuần.
zh_hans: 按主要语言聚合，用于形成周报主题段落。
zh_hant: 依主要語言群組形成週報章節

# agent.tool.permission.openWorldRead
source: Open Network Read
ar: قراءة من الشبكة المفتوحة
de: Offener Netzwerkzugriff
es: Lectura de red abierta
fr: Lecture sur réseau ouvert
id: Baca Jaringan Terbuka
it: Lettura da rete aperta
ja: オープンネットワーク読み取り
ko: 공개 네트워크 읽기
nl: Open-netwerktoegang
pl: Odczyt z otwartej sieci
pt_br: Leitura de rede aberta
ru: Чтение из открытой сети
tr: Açık Ağ Okuma
uk: Читання з відкритої мережі
vi: Đọc mạng mở
zh_hans: 开放网络读取
zh_hant: 開放網路讀取

# toolbar.status.readmePrefetch.title
source: README Prefetch
de: README-Vorabruf
es: Precarga de README
fr: Préchargement README
it: Prefetch README
ja: README プリフェッチ
ko: README 미리 가져오기
nl: README-vooraf ophalen
pl: Pobieranie README
pt_br: Pré‑busca de README
ru: Предварительная загрузка README
tr: README Ön Getirme
uk: Попереднє завантаження README
zh_hans: README 预拉
zh_hant: README 預先擷取

# agent.approval.status.pending
source: Pending approval
de: Wartet auf Genehmigung
es: Pendiente de aprobación
fr: En attente d'approbation
id: Menunggu Persetujuan
it: In attesa di approvazione
ja: 承認待ち
ko: 승인 대기 중
nl: Wacht op goedkeuring
pl: Oczekiwanie na zatwierdzenie
pt_br: Aguardando aprovação
ru: Ожидает утверждения
tr: Onay bekliyor
uk: Очікує схвалення
vi: Chờ phê duyệt
zh_hans: 等待审批
zh_hant: 待批准

# agent.weekly.tool.summary.report
source: Markdown Weekly Report
de: Markdown-Wochenbericht
es: Informe Semanal Markdown
fr: Rapport Hebdomadaire Markdown
ko: Markdown 주간 보고서
nl: Markdown Wekelijks Rapport
ru: Markdown Еженедельный Отчёт
tr: Markdown Haftalık Raporu
uk: Markdown Щомісячний Звіт
vi: Markdown Báo cáo Tuần
zh_hans: Markdown 技术周报
zh_hant: Markdown 周報

# rag.browser.repoContext.title
source: RepoContext XML
es: XML de RepoContext
fr: XML RepoContext
id: XML RepoContext
it: XML di RepoContext
pl: Plik RepoContext XML
pt_br: XML do RepoContext

# releaseNotes.image.accessibilityLabel
source: Screenshot
fr: Capture d'écran
ja: スクリーンショット
ko: 스크린샷
pl: Zrzut ekranu
pt_br: Captura de tela
ru: Снимок экрана
tr: Ekran görüntüsü
uk: Знімок екрана
vi: Ảnh chụp màn hình
zh_hans: 截图
zh_hant: 截圖

# agent.workspace.inspector.summary.tokens
source: Tokens
id: Token
it: Token
ja: トークン数
ko: 토큰
pl: Tokeny
ru: Токены
tr: Tokenler
uk: Токени
vi: Token
zh_hans: Token
zh_hant: Token

# wiki.source.codewiki
source: Code Wiki
ko: 코드 위키

# wiki.source.deepwiki
source: DeepWiki
ko: 딥위키

# agent.capability.fts
source: FTS
tr: FTÖ (Tam Metin Arama)
zh_hans: 全文检索

# agent.repoInsight.tool.summary.report
source: Repo Insight
vi: Starcat Repo Insight
zh_hans: 仓库洞察

# rag.browser.source.readme
source: README
pt_br: LEIAME

# about.support.openSource.detail
source: View the source code and star the project on GitHub.
zh_hans: 在 GitHub 查看源码并为 Starcat 点 Star。

# about.support.openSource.title
source: Starcat is open source
zh_hans: Starcat 已开源

# activity.category.notification
source: Timeline
zh_hans: 时间线
zh_hant: 時間線

# activity.category.organizationIssues
source: Organization Issues
zh_hans: 组织 Issues
zh_hant: 組織 Issues

# activity.notification.chip.assign
source: Assign
zh_hans: 指派
zh_hant: 指派

# activity.notification.chip.comment
source: Comment
zh_hans: 评论
zh_hant: 評論

# activity.notification.chip.mention
source: Mention
zh_hans: 提及
zh_hant: 提及

# activity.notification.chip.security
source: Security
zh_hans: 安全
zh_hant: 安全

# activity.notification.detail.actor
source: Requested by
zh_hans: 请求人
zh_hant: 請求人

# activity.notification.detail.empty.subtitle
source: Click any event in the middle column to read the discussion or act on the related repository.
zh_hans: 在中间栏点击任意事件，查看讨论或处理相关仓库。
zh_hant: 在中間欄點擊任意事件，查看討論或處理相關倉庫。

# activity.notification.detail.empty.title
source: Select an event to view details
zh_hans: 选择一条事件以查看详情
zh_hant: 選擇一則事件以查看詳情

# activity.notification.detail.excerpt
source: Summary
zh_hans: 摘要
zh_hant: 摘要

# activity.notification.detail.noDescription
source: No description
zh_hans: 没有描述
zh_hant: 沒有描述

# activity.notification.detail.openInStarcat
source: View in Starcat
zh_hans: 在 Starcat 中查看
zh_hant: 在 Starcat 中檢視

# activity.notification.detail.openOnGitHub
source: Open on GitHub
zh_hans: 在 GitHub 打开
zh_hant: 在 GitHub 開啟

# activity.notification.empty.subtitle
source: Notifications, organization issues, and your repository activity will show up here.
zh_hans: 通知、组织 Issues 和你的仓库活动会显示在这里。
zh_hant: 通知、組織 Issues 和你的倉庫活動會顯示在這裡。

# activity.notification.empty.title
source: No timeline activity yet
zh_hans: 时间线还没有活动
zh_hant: 時間線還沒有活動

# activity.notification.group.earlier
source: Earlier
zh_hans: 更早
zh_hant: 更早

# activity.notification.group.thisWeek
source: This week
zh_hans: 本周
zh_hant: 本週

# activity.notification.group.today
source: Today
zh_hans: 今天
zh_hant: 今天

# activity.notification.group.yesterday
source: Yesterday
zh_hans: 昨天
zh_hant: 昨天

# activity.notification.historyResync.action
source: Resync notification history
zh_hans: 重新同步通知历史
zh_hant: 重新同步通知歷史

# activity.notification.historyResync.confirm
source: Resync
zh_hans: 重新同步
zh_hant: 重新同步

# activity.notification.historyResync.confirmation.message
source: Review Starcat’s organization access on GitHub first. Existing notifications and read state will be kept while Starcat resets the sync position and fetches up to 300 recent threads again.
zh_hans: 请先在 GitHub 检查 Starcat 的组织访问权限。现有通知和已读状态会保留，Starcat 只会重置同步位置并重新获取最近 300 条通知。
zh_hant: 請先在 GitHub 檢查 Starcat 的組織存取權限。現有通知和已讀狀態會保留，Starcat 只會重設同步位置並重新取得最近 300 條通知。

# activity.notification.historyResync.confirmation.title
source: Resync notification history?
zh_hans: 重新同步通知历史？
zh_hant: 重新同步通知歷史？

# activity.notification.lastSynced
source: Synced %@
zh_hans: 上次同步：%@
zh_hant: 上次同步：%@

# activity.notification.missingScope.action
source: Sign in again
zh_hans: 重新授权
zh_hant: 重新授權

# activity.notification.missingScope.subtitle
source: Starcat needs the notifications scope. Sign out and authorize again.
zh_hans: 需要 notifications 权限。请退出后重新授权。
zh_hant: 需要 notifications 權限。請登出後重新授權。

# activity.notification.missingScope.title
source: Notifications permission required
zh_hans: 需要通知权限
zh_hant: 需要通知權限

# activity.notification.organizationAccess.action
source: Organization notification access
zh_hans: 组织通知授权
zh_hant: 組織通知授權

# activity.notification.segment.all
source: All
zh_hans: 全部
zh_hant: 全部

# activity.notification.segment.unread
source: Unread
zh_hans: 未读
zh_hant: 未讀

# activity.notification.timeline.closed
source: %@ closed this
zh_hans: %@ 关闭了此项
zh_hant: %@ 關閉了此項

# activity.notification.timeline.crossReferenced.prefix
source: %@ mentioned this in
zh_hans: %@ 在
zh_hant: %@ 在

# activity.notification.timeline.labeled.prefix
source: %@ added the
zh_hans: %@ 添加了标签
zh_hant: %@ 新增了標籤

# activity.notification.timeline.loadFailed
source: Couldn't load the timeline
zh_hans: 无法加载时间线
zh_hant: 無法載入時間線

# activity.notification.timeline.referenced.prefix
source: %@ referenced this in
zh_hans: %@ 在
zh_hant: %@ 在

# activity.notification.timeline.renamed
source: %@ changed the title from “%@” to “%@”
zh_hans: %@ 将标题从「%@」改为「%@」
zh_hant: %@ 將標題從「%@」改為「%@」

# activity.notification.timeline.reopened
source: %@ reopened this
zh_hans: %@ 重新打开了此项
zh_hant: %@ 重新開啟了此項

# activity.notification.timeline.unlabeled.prefix
source: %@ removed the
zh_hans: %@ 移除了标签
zh_hant: %@ 移除了標籤

# activity.organizationIssues.detail.empty.subtitle
source: Select an issue from the list to view its details.
zh_hans: 从列表中选择一条 Issue 查看详情。
zh_hant: 從列表中選擇一條 Issue 查看詳情。

# activity.organizationIssues.detail.empty.title
source: No issue selected
zh_hans: 未选择 Issue
zh_hant: 未選擇 Issue

# activity.organizationIssues.detail.noBody
source: No description was provided.
zh_hans: 这条 Issue 没有描述。
zh_hant: 這條 Issue 沒有描述。

# activity.organizationIssues.detail.openOnGitHub
source: Open on GitHub
zh_hans: 在 GitHub 打开
zh_hant: 在 GitHub 開啟

# activity.organizationIssues.empty.subtitle
source: No issues match the current organization and state filters.
zh_hans: 当前组织和状态筛选下没有 Issue。
zh_hant: 目前組織和狀態篩選下沒有 Issue。

# activity.organizationIssues.empty.title
source: No organization issues
zh_hans: 没有组织 Issue
zh_hant: 沒有組織 Issue

# activity.organizationIssues.error.generic
source: Organization issues could not be loaded.
zh_hans: 无法加载组织 Issues。
zh_hant: 無法載入組織 Issues。

# activity.organizationIssues.error.title
source: Could not load issues
zh_hans: Issue 加载失败
zh_hant: Issue 載入失敗

# activity.organizationIssues.loadMore
source: Load more
zh_hans: 加载更多
zh_hant: 載入更多

# activity.organizationIssues.noOrganizations.subtitle
source: Connect My Projects and sync the organizations you want Starcat to access.
zh_hans: 请先连接“我的项目”，并同步允许 Starcat 访问的组织。
zh_hant: 請先連接「我的專案」，並同步允許 Starcat 存取的組織。

# activity.organizationIssues.noOrganizations.title
source: No authorized organizations
zh_hans: 没有已授权组织
zh_hant: 沒有已授權組織

# activity.organizationIssues.organization.all
source: All organizations
zh_hans: 全部组织
zh_hant: 全部組織

# activity.organizationIssues.retry
source: Try again
zh_hans: 重试
zh_hant: 重試

# activity.organizationIssues.state.all
source: All
zh_hans: 全部
zh_hant: 全部

# activity.organizationIssues.state.closed
source: Closed
zh_hans: 已关闭
zh_hant: 已關閉

# activity.organizationIssues.state.label
source: Issue state
zh_hans: Issue 状态
zh_hant: Issue 狀態

# activity.organizationIssues.state.open
source: Open
zh_hans: 进行中
zh_hant: 進行中

# agent.capability.externalRuntime
source: Runtime
zh_hans: 外部 Runtime

# agent.capability.readOnly
source: Read-only
zh_hans: 只读

# agent.capability.repositories
source: Repositories
zh_hans: 仓库

# agent.capability.research
source: Research
zh_hans: 研究

# agent.capability.session
source: Session
zh_hans: 会话

# agent.definition.general.artifactTitle
source: Agent Result
zh_hans: Agent 结果

# agent.definition.general.defaultPrompt
source: Answer using the provided Starcat context.
zh_hans: 请根据提供的 Starcat 上下文回答问题。

# agent.definition.general.subtitle
source: General read-only tasks across supported Agent Runtimes
zh_hans: 通过可切换 Agent Runtime 完成通用只读任务

# agent.definition.general.title
source: General Agent
zh_hans: 通用 Agent

# agent.definition.research.artifactTitle
source: Research Result
zh_hans: 研究结果

# agent.definition.research.defaultPrompt
source: Compare the selected repositories and provide evidence-backed conclusions.
zh_hans: 请比较所选仓库并给出有依据的研究结论。

# agent.definition.research.subtitle
source: Compare repositories using an explicit frozen context
zh_hans: 基于显式冻结的仓库上下文完成对比研究

# agent.definition.research.title
source: Research Agent
zh_hans: 研究 Agent

# agent.workspace.history.collapse
source: Show Less
zh_hans: 收起

# agent.workspace.history.moreFormat
source: More (%d)
zh_hans: 更多（%d）

# agent.workspace.section.analysis
source: Analysis
zh_hans: 分析

# agent.workspace.section.general
source: General
zh_hans: 通用

# agent.workspace.section.monitor
source: Monitor
zh_hans: 监控

# agent.workspace.trace.audit.issues
source: Issues
zh_hans: 异常

# agent.workspace.trace.audit.model
source: Model
zh_hans: 模型

# agent.workspace.trace.audit.tools
source: Tools
zh_hans: 工具

# agent.workspace.trace.audit.total
source: All
zh_hans: 全部

# agent.workspace.trace.mode.allEvents
source: All events
zh_hans: 全部事件

# agent.workspace.trace.mode.process
source: Process
zh_hans: 执行过程

# agent.workspace.trace.contentTruncated
source: The timeline preview was limited to keep scrolling responsive. Use the runtime log when the complete raw payload is required.
zh_hans: 时间线预览已限制内容量，以保持展开和滚动流畅；如需完整原始载荷，请查看 Runtime 日志。

# agent.workspace.trace.deepSeekBlocked
source: The turn ended because execution was blocked.
zh_hans: 本轮执行因阻塞而结束。

# agent.workspace.trace.deepSeekInterrupted
source: The Runtime recovered a previously interrupted turn.
zh_hans: Runtime 恢复到一轮此前异常中断的执行。

# agent.workspace.trace.deepSeekMaxTokens
source: A model step reached the output token limit.
zh_hans: 某个模型步骤达到了输出 Token 上限。

# agent.workspace.trace.eventData
source: Event Data
zh_hans: 事件数据

# agent.workspace.trace.fragmentCountFormat
source: %d prompt fragments
zh_hans: %d 个提示片段

# agent.workspace.trace.kind.collaboration
source: Agent Collaboration
zh_hans: Agent 协作

# agent.workspace.trace.kind.enteredReview
source: Entered Review Mode
zh_hans: 进入审查模式

# agent.workspace.trace.kind.exitedReview
source: Exited Review Mode
zh_hans: 退出审查模式

# agent.workspace.trace.kind.hookPrompt
source: Hook Prompt
zh_hans: Hook 提示

# agent.workspace.trace.kind.imageGeneration
source: Image Generation
zh_hans: 图像生成

# agent.workspace.trace.kind.imageView
source: View Image
zh_hans: 查看图像

# agent.workspace.trace.kind.lifecycle
source: Lifecycle
zh_hans: 生命周期

# agent.workspace.trace.kind.subAgentActivity
source: Sub-agent Activity
zh_hans: 子 Agent 活动

# agent.workspace.trace.kind.waiting
source: Waiting
zh_hans: 等待

# agent.workspace.trace.kind.message
source: Runtime Message
zh_hans: Runtime 消息

# agent.workspace.trace.kind.request
source: Model Request
zh_hans: 模型请求

# agent.workspace.trace.kind.step
source: Step
zh_hans: 步骤

# agent.workspace.trace.kind.todo
source: Task Plan
zh_hans: 任务计划

# agent.workspace.trace.kind.turn
source: Turn
zh_hans: 轮次

# agent.workspace.trace.reason
source: Reason
zh_hans: 原因

# agent.workspace.trace.requestConfig
source: Request Configuration
zh_hans: 请求配置

# agent.workspace.trace.requestContext
source: Route Context
zh_hans: 路由上下文

# agent.workspace.trace.todos
source: Tasks
zh_hans: 任务

# agent.workspace.trace.detail
source: Details
zh_hans: 详情

# agent.workspace.trace.rawData
source: View Raw Data
zh_hans: 查看原始数据

# agent.workspace.trace.reasoningPending
source: Generating a reasoning summary…
zh_hans: 正在生成思考摘要…

# agent.workspace.trace.reasoningUnavailable
source: The runtime did not provide a displayable reasoning summary.
zh_hans: 当前 Runtime 未提供可展示的思考摘要。

# agent.workspace.trace.sources
source: Sources
zh_hans: 来源

# agent.workspace.trace.summary
source: Summary
zh_hans: 摘要

# agent.workspace.trace.changes
source: Changes
zh_hans: 变更

# agent.workspace.trace.error
source: Error
zh_hans: 错误

# agent.workspace.trace.kind.command
source: Command
zh_hans: 命令

# agent.workspace.trace.kind.commentary
source: Progress Update
zh_hans: 进度说明

# agent.workspace.trace.kind.contextCompaction
source: Context Compaction
zh_hans: 上下文压缩

# agent.workspace.trace.kind.fileChanges
source: File Changes
zh_hans: 文件变更

# agent.workspace.trace.kind.warning
source: Warning
zh_hans: 警告

# agent.workspace.trace.kind.webSearch
source: Web Search
zh_hans: 网页搜索

# agent.workspace.trace.message
source: Message
zh_hans: 消息

# agent.workspace.trace.previousError
source: Previous Error
zh_hans: 上次错误

# agent.workspace.trace.progressUpdate
source: Progress Update
zh_hans: 进度说明

# agent.workspace.trace.query
source: Query
zh_hans: 查询

# agent.workspace.trace.repoCountFormat
source: %d repositories
zh_hans: %d 个仓库

# agent.workspace.trace.stepCountFormat
source: %d steps
zh_hans: %d 个步骤

# agent.workspace.trace.tool.agentParseGoal
source: Parse Weekly Report Goal
zh_hans: 解析周报目标

# agent.workspace.trace.tool.applyUntagged
source: Apply Tag Cleanup
zh_hans: 应用标签整理

# agent.workspace.trace.tool.buildRepoAlternatives
source: Build Alternatives Report
zh_hans: 生成替代品报告

# agent.workspace.trace.tool.buildRepoInsight
source: Build Repository Insight
zh_hans: 生成仓库洞察

# agent.workspace.trace.tool.buildWeeklyReport
source: Build Weekly Report
zh_hans: 生成周报

# agent.workspace.trace.tool.completed
source: Tool call completed
zh_hans: 工具调用已完成

# agent.workspace.trace.tool.contextResolveRepos
source: Resolve Repositories
zh_hans: 解析仓库范围

# agent.workspace.trace.tool.contextSelectRepo
source: Select Repository
zh_hans: 选择仓库

# agent.workspace.trace.tool.externalSearch
source: External Search
zh_hans: 外部搜索

# agent.workspace.trace.tool.failed
source: Tool call failed
zh_hans: 工具调用失败

# agent.workspace.trace.tool.inspectUntagged
source: Inspect Untagged Repositories
zh_hans: 检查未标签仓库

# agent.workspace.trace.tool.knowledgeSearch
source: Knowledge Search
zh_hans: 知识库检索

# agent.workspace.trace.tool.parseRepoAlternativesGoal
source: Parse Alternatives Goal
zh_hans: 解析替代品目标

# agent.workspace.trace.tool.parseRepoInsightGoal
source: Parse Repository Insight Goal
zh_hans: 解析仓库洞察目标

# agent.workspace.trace.tool.previewUntagged
source: Preview Tag Cleanup
zh_hans: 预览标签整理

# agent.workspace.trace.tool.repoClusterTopics
source: Cluster Repository Topics
zh_hans: 聚类仓库主题

# agent.workspace.trace.tool.readReadme
source: Read README
zh_hans: 读取 README

# agent.workspace.trace.tool.readRepositorySummary
source: Read Repository Summary
zh_hans: 读取仓库摘要

# agent.workspace.trace.tool.running
source: Calling Starcat tool
zh_hans: 正在调用 Starcat 工具

# agent.workspace.trace.tool.searchRepositories
source: Search Repositories
zh_hans: 搜索仓库

# agent.workspace.trace.toolID
source: Tool ID
zh_hans: 工具 ID

# agent.workspace.trace.warningFallback
source: Codex reported a warning.
zh_hans: Codex 返回了一条警告。

# ai.assistant.summary.empty.lead
source: Choose what extra context this summary should use. You can change these for this run only.
zh_hans: 选择这次摘要要带上哪些额外上下文。下面的选项只对本次生成生效。

# ai.assistant.summary.options.codeContext.subtitle
source: Analyze the repository code structure so the AI can understand the project more accurately. Related code is prepared only after you generate.
zh_hans: 分析仓库代码结构，帮助 AI 更准确地理解项目。相关代码仅在点击生成后准备。

# ai.assistant.summary.options.codeContext.title
source: Code Context
zh_hans: 代码上下文

# ai.assistant.summary.options.externalSearch.privateBlocked
source: This repository is private, and Settings currently disallow external search for private repos.
zh_hans: 当前仓库是私有仓库，且设置未允许对私有仓库使用外部搜索。

# ai.assistant.summary.options.externalSearch.subtitle
source: Fetch web sources as extra context for this summary. Private repositories still follow the Allow Private Repos setting.
zh_hans: 检索网页资料作为本次摘要的补充上下文。私有仓库仍受「允许私有仓库」设置约束。

# ai.assistant.summary.options.externalSearch.title
source: External Search
zh_hans: 外部搜索

# ai.assistant.summary.options.externalSearch.unavailable
source: No External Search provider is configured.
zh_hans: 尚未配置可用的外部搜索服务。

# ai.assistant.summary.options.footnote
source: These choices apply only to this summary. They do not change your default settings.
zh_hans: 这两个选项只对本次生成生效，不会改设置里的默认开关。

# ai.assistant.summary.options.section
source: This generation
zh_hans: 本次生成

# ai.provider.doubao
source: Doubao
zh_hans: 豆包
zh_hant: 豆包

# ai.provider.doubao.name
source: Doubao
zh_hans: 豆包
zh_hant: 豆包

# ai.provider.hunyuan
source: Hunyuan
zh_hans: 混元
zh_hant: 混元

# ai.provider.hunyuan.name
source: Hunyuan
zh_hans: 混元
zh_hant: 混元

# ai.provider.qianwen
source: Qwen
zh_hans: 通义千问
zh_hant: 通義千問

# ai.provider.qianwen.name
source: Qwen
zh_hans: 通义千问
zh_hant: 通義千問

# ai.provider.siliconflow
source: SiliconFlow
zh_hans: 硅基流动
zh_hant: 矽基流動

# ai.provider.siliconflow.name
source: SiliconFlow
zh_hans: 硅基流动
zh_hant: 矽基流動

# ai.provider.zhipu
source: Zhipu AI
zh_hans: 智谱 AI
zh_hant: 智譜 AI

# ai.provider.zhipu.name
source: Zhipu AI
zh_hans: 智谱 AI
zh_hant: 智譜 AI

# ai.usage.feature.repo_grouping
source: Repository Grouping
zh_hans: 仓库分组
zh_hant: 倉庫分組

# ambient.empty.message
source: Sync some repositories, then open Ambient
zh_hans: 同步一些仓库后再打开 Ambient

# ambient.empty.title
source: No stars to display
zh_hans: 还没有可展示的 Star

# ambient.error.message
source: Try again, or exit and reopen Ambient
zh_hans: 请重试，或退出后再打开

# ambient.error.title
source: Couldn’t load Ambient
zh_hans: 无法载入 Ambient

# ambient.exit
source: Exit
zh_hans: 退出

# ambient.loading
source: Preparing Ambient…
zh_hans: 正在准备 Ambient…

# ambient.menu.openOwners
source: Ambient · Owners
zh_hans: Ambient · Owner

# ambient.menu.openRepos
source: Ambient · Repositories
zh_hans: Ambient · 仓库

# ambient.retry
source: Retry
zh_hans: 重试

# awesome.detail.currentSource
source: Current source
zh_hans: 当前来源

# awesome.detail.openSourceEntry
source: View original README entry
zh_hans: 查看原始 README 条目

# awesome.detail.sectionFormat
source: Section: %@
zh_hans: 所属章节：%@

# awesome.detail.sources.title
source: Awesome Sources
zh_hans: Awesome 收录来源
